0_attachments/6_exhaust_gas_recirculation/1_exhaust_gas_recirculation/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet_air
    {
        type        fixedValue;
        value       uniform 300;
    }

    inlet_exhaust
    {
        type        fixedValue;
        value       uniform 900;
    }

    outlet
    {
        type        zeroGradient;
    }

    pipe_air
    {
        type        zeroGradient;
    }

    pipe_exhaust
    {
        type        zeroGradient;
    }
}


// ************************************************************************* //
