0_attachments/6_exhaust_gas_recirculation/1_exhaust_gas_recirculation/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet_air
    {
        type                flowRateInletVelocity;
        volumetricFlowRate  0.005;
        value               uniform (0 0 0);
    }

    inlet_exhaust
    {
        type                flowRateInletVelocity;
        volumetricFlowRate  0.0025;
        value               uniform (0 0 0);
    }

    outlet
    {
        type                zeroGradient;
    }

    pipe_air
    {
        type                noSlip;
    }

    pipe_exhaust
    {
        type                noSlip;
    }
}


// ************************************************************************* //
