0_attachments/6_exhaust_gas_recirculation/1_exhaust_gas_recirculation/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet_air
    {
        type        calculated;
        value       uniform 0;
    }

    inlet_exhaust
    {
        type        calculated;
        value       uniform 0;
    }

    outlet
    {
        type        calculated;
        value       uniform 0;
    }

    pipe_air
    {
        type        compressible::alphatWallFunction;
        value       uniform 0;
    }

    pipe_exhaust
    {
        type        compressible::alphatWallFunction;
        value       uniform 0;
    }
}


// ************************************************************************* //
