0_attachments/6_exhaust_gas_recirculation/1_exhaust_gas_recirculation/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    inlet_air
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.02;
        value           uniform 0.1;
    }
    inlet_exhaust
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.08;
        value           uniform 0.1;
    }

    outlet
    {
        type            zeroGradient;
    }

    pipe_air
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }

    pipe_exhaust
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
}


// ************************************************************************* //
