0_attachments/6_exhaust_gas_recirculation/1_exhaust_gas_recirculation/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1e4;

boundaryField
{
    inlet_air
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    0.04;
        value           uniform 1e4;
    }

    inlet_exhaust
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    0.02;
        value           uniform 1e4;
    }

    outlet
    {
        type            zeroGradient;
    }

    pipe_air
    {
        type            omegaWallFunction;
        value           uniform 0.1;
    }

    pipe_exhaust
    {
        type            omegaWallFunction;
        value           uniform 0.1;
    }
}


// ************************************************************************* //
