0_attachments/6_exhaust_gas_recirculation/1_exhaust_gas_recirculation/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-25 -25 -25)
    (375 -25 -25)
    (375 175 -25)
    (-25 175 -25)
    (-25 -25 25)
    (375 -25 25)
    (375 175 25)
    (-25 175 25)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (24 12 3) simpleGrading (1 1 1)
);

boundary
(
    box
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
