0_attachments/6_exhaust_gas_recirculation/1_exhaust_gas_recirculation/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solver          fluid;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.08;

deltaT          1.25e-5;

writeControl    runTime;

writeInterval   0.002;

// ************************************************************************* //
