0_attachments/6_exhaust_gas_recirculation/1_exhaust_gas_recirculation/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeFunc residuals
(
    name    = residuals,
    fields  = (p U h k omega)
)

#includeFunc probes
(
    name    = probes,
    fields  = (T),
    points  = 
        (
            (0.12 0 0)
            (0.15 0 0)
            (0.18 0 0)
        )
)

#includeFunc patchAverage
(
    name    = avgT,
    patch   = outlet,
    fields  = (T)
)

#includeFunc fieldAverage
(
    fields  = (U T)
)

#includeFunc cellMax
(
    name    = maxT,
    fields  = (T)
)

// ************************************************************************* //
