0_attachments/6_exhaust_gas_recirculation/1_exhaust_gas_recirculation/system/meshQualityDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

maxNonOrtho       65;

maxBoundarySkewness 20;

maxInternalSkewness 4;

maxConcave        80;

minVol            -1e30;

minTetQuality     -1e30;

minTwist          0.02;

minDeterminant    0.001;

minFaceWeight     0.05;

minVolRatio       0.01;

nSmoothScale      4;

errorReduction    0.75;

relaxed
{
    maxNonOrtho       75;
}

// ************************************************************************* //
